/**
 *  20170526
 */

module.exports =
{
    trade_assign_traffic:{
        content:'尊敬的#总，#给您指派#—###吨运输，每吨约#元，请立即接单',  //#20180113
        //'尊敬的#总，#集团给您指派运输#—###吨运输，每吨约#元，请立即接单'
        //尊敬的XX总，XX集团给您指派运输太原—长治螺纹钢3852吨运输，每吨100元，请立即接单（链接：）；20171227
            // '##发布#至#的#等产品物流指派，吨数有限，请及时参与',//'##发布#等产品的物流指派，尽早参与可能达成更大量的物流订单',
        //【华润集团】【王林】发布【北京市】至【天津市】的【炼焦煤】等产品物流指派，吨数有限，请及时参与
        tts:'##发布#至#的#等产品物流指派，吨数有限',
        element_count:8
    },
    traffic_agree_assign:{
        content:'您发布的#至#的#等产品物流指派，已被##接单,请点击查看',
            //'您发布的#等产品物流指派，已被##抢单，请点击查看', 
            // 您发布的【北京市】至【天津市】的【螺纹钢】等产品物流指派，已被【顺丰物流】【王林】接单，请点击查看
        tts:'您发布的#至#的#等产品物流指派，已被##接单',
        element_count:1
    },
    traffic_order:{
        content:'尊敬的#总，恭喜您，#给您指派#—####运输，请立即登录接单',    //#
            // '尊敬的xx总，恭喜您，xx集团给您指派太原—长治3200吨螺纹钢运输，请立即登录接单', 20171226
            // '您参与的#至#的#等产品物流指派，已被货主下单，请点击查看',
        // 您参与的【北京市】至【天津市】的【炼焦煤】等产品物流指派，已被货主下单，请点击查看
        tts:'您参与的#至#的#等产品物流指派，已被货主下单',
        element_count:8
    },
    traffic_assign_driver:{
        content: '#给您指派#—##运输，每吨#元，登录vehicles.e-wto.com或回复#（物流指派人）确认接单，信息费减免30%-100%详细根据活动查看',
        //鑫汇物流给您指派大同—太原线材类运输，每吨运费50元，请点击vehicles.e-wto.com下载在线接单，立即领取300元现金红包或回复电话13731688888（物流指派人）现场支付信息费，退订回T
        // 鑫汇物流给您指派大同-太原线材类运输，运费50元/吨，请点击vehicles.e-wto.com在线接单，立即获得免信息费的机会！或回复电话18888888888现场支付信息费，退订回T
        // '#给您指派#-##运输，运费#元/吨，请点击vehicles.e-wto.com在线接单，立即获得免信息费的机会！或回复电话#现场支付信息费，退订回T'
        //%s给您指派%s—%s%s类运输，每吨运费%s元，请点击%s下载在线接单，%s回复电话13731688888（物流指派人）现场支付信息费，退订回T
        // content:'尊敬的#，#物流给您指派运输#—##运输，每吨#元，特价优惠，vehicles.e-wto.com',    //#
        //20180402 【运输中心】鑫汇物流给您指派大同—太原线材类运输，每吨50元，登录vehicles.e-wto.com或回复13731688888（物流指派人）确认接单，信息费减免30%-100%详细根据活动查看，退订回T

        // 特价优惠，信息费0元，,vehicles.e-wto.com   20180329
            //尊敬的XX先生，XX物流给您指派运输太原—长治螺纹钢运输，每吨80元，请立即接单（链接：）；
            // '#-#，发布运输需求：#至#，货物#等，吨数有限，请及时抢单！',
        //'##发布#至#的#等产品司机指派，吨数有限，请及时参与',//'##发布#等产品司机指派，请点击查看',
            // 【顺丰物流】【王林】发布【北京市】至【天津市】的【炼焦煤】等产品司机指派，吨数有限，请及时参与
        tts: '#-#，发布运输需求：#至#，货物#等，吨数有限',//'##发布#至#的#等产品司机指派，吨数有限',
        element_count:7
    },
    traffic_assign_driver_red:{
        content: '#给您指派#-##运输，总运量#吨，运费#元/吨，请点击#在线接单，#现场支付信息费',
        element_count:8
    },
    traffic_order_complete:{
        content: '恭喜您，#—#的###运输完成,请及时查看',   //#
        // 恭喜您，山东=河北的200吨煤炭运输完成,请及时查看。系统将双方确认的订单中的货物名称、总吨数、总运费、付款类型、付款方式，系统推送；20171227
        tts: '#-#，发布运输需求：#至#，货物#等，吨数有限',//'##发布#至#的#等产品司机指派，吨数有限',
        element_count: 6
    },
    driver_agree_assign:{
        content:'你发布的#-#的产品司机指派，已被##接单，请点击查看',
            tts:'你发布的#到#的产品司机指派，已被##接单',
        element_count:1
    },
    // 废弃
    replace_driver_agree:{
        content: '已分配吨数#吨，请到#拉货',
        //'##已替您承接#至#的###等产品的运输，提货码为#，请点击查看',// ##已代理您接#-#的运输！http://www.rsc365.com',
        //【顺丰物流】【王林】已替您承接【北京市】至【天津市】的【35.234】吨【螺纹钢】等产品的运输，请点击查看
        tts:'已分配吨数#吨，请到#拉货',
        element_count:1
    },
    driver_order:{
        content:
            '#给您指派#—##运输#吨，每吨#元。请立即前往#现场确认运输信息，联系人：#，电话#，登录在线查看vehicles.e-wto.com',
        //恭喜您获得鑫汇物流首单免信息费！ 鑫汇物流给您指派大同—太原16件线材类运输，理计重量33.120吨，运费150元/吨。需立即前往鑫汇物流现场确认运输信息，开取派车单，联系人：周正民，电话13731688888，退订回T
        // '恭喜您获得#首单免信息费！ #给您指派#—##，理计重量#吨，运费#元/吨。需立即前往#确认运输信息，开取派车单，联系人：#，电话#',
        //鑫汇物流给您指派大同—太原线材类运输33.120吨，每吨运费150元。请立即前往鑫汇物流现场确认运输信息，联系人：周正民，电话13731688888，或登录在线支付信息费，立即领取300元现金红包，vehicles.e-wto.com，退订回T；
        //%s给您指派%s—%s%s类运输%s吨，每吨运费%s元。请立即前往%s现场确认运输信息，%s，或登录在线支付信息费，%s，退订回T；
        //content: '尊敬的#，#物流给您指派运输#—##运输#吨，每吨#元。请立即前往#领取派车单，联系人：#，电话#，登录在线查看vehicles.e-wto.com',  //20171227#
        //20180402 【运输中心】鑫汇物流给您指派大同—太原线材类运输33.120吨，每吨150元。请立即前往鑫汇物流现场确认运输信息，联系人：周正民，电话18888888814，登录在线查看vehicles.e-wto.com，退订回T
        //特价优惠，信息费0元,vehicles.e-wto.com 20180329
        //尊敬的XX先生，XX物流给您指派运输太原—长治螺纹钢运输37.62吨，每吨80元。请立即前往青创物流领取派车单，联系人：张大，电话13910005800，登录在线查看（链接：）；
        // '##已为您指派#至#的###等产品的运输，提货码为#,请点击查看',
        //【顺丰物流】【王林】已为您指派【北京市】至【天津市】的【35.234】吨【螺纹钢】等产品的运输，请点击查看
        // tts:'##已为您指派#至#的###等产品的运输',
        element_count: 11
    },
    driver_order_red:{
        content:'#给您指派#—##运输，理计重量#吨，运费#元/吨。需立即前往#现场确认运输信息，联系人：#，电话#，或登录在线支付信息费#',
        element_count: 11
    },
    driver_supply_loading:{
        content: '#至#的的物流订单，司机##已申请提货，请点击查看', //'你的#-#的物流订单，##已完成运输,请点击查看',
        //【北京市】至【天津市】的的物流订单，司机【王林】【京NB1234】已申请提货，请点击查看
        tts:'#至#的的物流订单，司机##已申请提货',
        element_count:1
    },
    driver_supply_unloading:{
        content: '#至#的的物流订单，司机##已申请交货，请点击查看', //'你的#-#的物流订单，##已完成运输,请点击查看',
        //【北京市】至【天津市】的的物流订单，司机【王林】【京NB1234】已申请提货，请点击查看
        tts:'#至#的的物流订单，司机##已申请交货',
        element_count:1
    },
    driver_order_complete:{
        content:'恭喜您，#—#的###运输完成,请及时查看',    //#
        // 恭喜您，山东=河北的200吨煤炭运输完成,请及时查看。系统将双方确认的订单中的货物名称、总吨数、总运费、付款类型、付款方式，系统推送；20171227
        //'#至#的的物流订单，司机##已完成运输，请点击查看', 
        //'你的#-#的物流订单，##已完成运输,请点击查看',
        //【北京市】至【天津市】的的物流订单，司机【王林】【京NB1234】已完成运输，请点击查看
        tts:'#至#的的物流订单，司机##已完成运输',
        element_count:1
    },
    //废弃
    line_view:{
        content: '尊敬的#总你好，您发布的线路报价已被#等#家新的企业查看未下单，请立即登录查看', //#
        //尊敬的xx总你好，您发布的钢铁报价被5家新的企业查看未下单，请立即登录查看 20171227
        // tts:'#至#的的物流订单，司机##已完成运输',
        element_count: 4
    },
    //废弃
    driver_demand_view:{
        content: '尊敬的#总你好，您发布的需求单已被#等#家新的企业查看未下单，请立即登录查看', //#
        //尊敬的xx总你好，您发布的钢铁报价被5家新的企业查看未下单，请立即登录查看 20171227
        // tts:'#至#的的物流订单，司机##已完成运输',
        element_count: 4
    },
    //废弃
    demand_view:{
        content: '尊敬的#总你好，您发布的需求单已被#等#家新的企业查看未下单，请立即登录查看', //#20180113
        //尊敬的xx总你好，您发布的钢铁报价被5家新的企业查看未下单，请立即登录查看 20171227
        // tts:'#至#的的物流订单，司机##已完成运输',
        element_count: 4
    },
    driver_loading: {
        content:"您与#公司达成的#吨#运输订单提货日为今天（#），请在提货时间内申请提货，逾期信息费不退回",
        element_count: 4
        //    您与德邦物流公司达成的100吨钢铁运输订单提货日为今天（2018年3月15日），请在提货时间内申请提货，逾期信息费不退回
    },
    driver_tip_price: {
        content: '司机#，车牌号#，已支付信息费#元',
        element_count: 2
        //鑫汇物流恭喜您已通过（现金红包支付信息费100元/用余额支付信息费100元）成功，请立即前往鑫汇钢铁1号库提货，联系人：（驻厂业务员），电话（18888888823），凭此短信开取派车单；请实时关注司机中心的货源信息，登录在线查看vehicles.e-wto.com
        //%s恭喜您已通过%s成功，请立即前往%s，凭此短信开取派车单；请实时关注司机中心的货源信息，登录在线查看%s
    },
    driver_tip_price_red: {
        content: '#恭喜您已通过#成功，请驾驶#前往#装取#，理计重量#吨，联系人：（#），电话（#），凭此短信开取派车单；请实时关注司机中心的货源信息，登录在线查看#',
        element_count: 2
    },
    tip_price_input: {
        content: '司机#，车牌号#，已申请提货，信息费#元已到您的账户',
        element_count: 2
    },
    view_demand:{
        content: '#正在浏览你的货源',
        tts:'#正在浏览你的货源',
        element_count:1
    },
    replace_truck:{
        content: '#物流已将您的车辆替换，更多货源请关注#物流',
        element_count: 2
    },
    //线下找车描述
    // 请驾驶 冀U88393 前往河北邯郸鑫汇成品库装取16件高线，理计重量34吨，领取派车单联系电话15399008899
    //请驾驶%s前往%s装取%s，领取派车单联系电话%s
    //鑫汇物流已邀请您成为合作车辆，24小时内登录赠送300元现金红包，先到先得，海量货源请点击查看vehicles.e-wto.com
    //%s已邀请您成为合作车辆，%s海量货源请点击查看%s
    encodeContent: function (template_id, content) {
        var result = '';
        var msg_array = this[template_id]['content'].split('#');
        for (var i = 0; i < msg_array.length - 1; i++) {
            result += msg_array[i];
            result += content[i];
        }
        result += msg_array.pop();
        return result;
    },
    mp3Content: function (template_id, content) {
        var result = '';
        var msg_array = this[template_id]['tts'].split('#');
        for (var i = 0; i < msg_array.length - 1; i++) {
            result += msg_array[i];
            result += content[i];
        }
        result += msg_array.pop();
        return result;
    }

};